InformationRegisters/ВыполнениеЗаданийТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеЗаданийТП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Посещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияТП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удалить_ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияТППоВнеплановымПосещениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияТППоВнеплановымПосещениям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удалить_ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Посещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Посещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияПосещений</xr:Item>
				<xr:Item>InformationRegister.ЗаданияТППоВнеплановымПосещениям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПосещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПосещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийДень</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РабочийДень</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельПосещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПосещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаданияТорговомуПредставителю</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВыполнениеЗаданийТП/Ext/ManagerModule.bsl
Процедура ОтметитьВыполнениеЗаданияТП(Маршрут, Контрагент, ВидЗадания, ДокументСсылка, ШаблонАнкеты = Неопределено) Экспорт
	Перем Запрос, РезультатЗапроса, ВыборкаДетальныеЗаписи, МенеджерЗаписи;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданияТП.Маршрут,
	|	ЗаданияТП.ВидЗадания,
	|	ЗаданияТП.Контрагент КАК Контрагент,
	|	ИСТИНА КАК Выполнено,
	|	ЗНАЧЕНИЕ(Документ.Посещение.ПустаяСсылка) КАК Посещение,
	|	NULL КАК ШаблонАнкеты
	|ИЗ
	|	РегистрСведений.ЗаданияТП КАК ЗаданияТП
	|ГДЕ
	|	ЗаданияТП.Маршрут = &Маршрут
	|	И ЗаданияТП.ВидЗадания = &ВидЗадания
	|	И ЗаданияТП.Контрагент = &Контрагент
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданияТППоВнеплановымПосещениям.Маршрут,
	|	ЗаданияТППоВнеплановымПосещениям.ВидЗадания,
	|	ЗаданияТППоВнеплановымПосещениям.Контрагент,
	|	ИСТИНА,
	|	ЗаданияТППоВнеплановымПосещениям.Посещение,
	|	ЗаданияТППоВнеплановымПосещениям.ШаблонАнкеты
	|ИЗ
	|	РегистрСведений.ЗаданияТППоВнеплановымПосещениям КАК ЗаданияТППоВнеплановымПосещениям
	|ГДЕ
	|	ЗаданияТППоВнеплановымПосещениям.Маршрут = &Маршрут
	|	И ЗаданияТППоВнеплановымПосещениям.ВидЗадания = &ВидЗадания
	|	И ЗаданияТППоВнеплановымПосещениям.Контрагент = &Контрагент";
	Если ДокументСсылка.Пустая() Тогда
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Посещение") Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ЗаданияТППоВнеплановымПосещениям.Посещение = &Посещение";
		Запрос.УстановитьПараметр( "Посещение", ДокументСсылка );
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	И ЗаданияТППоВнеплановымПосещениям.Посещение = &Посещение";
		Запрос.УстановитьПараметр( "Посещение", ДокументСсылка.Посещение );
	КонецЕсли;
	Если ТипЗнч(ВидЗадания) = Тип("Строка") Тогда
		Запрос.УстановитьПараметр( "ВидЗадания", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент(ВидЗадания) );
	Иначе
		Запрос.УстановитьПараметр( "ВидЗадания", ВидЗадания );
	КонецЕсли;
	
	//Киселев 19-09-2017
	Если ШаблонАнкеты <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ЗаданияТППоВнеплановымПосещениям.ШаблонАнкеты = &ШаблонАнкеты";
		Запрос.УстановитьПараметр("ШаблонАнкеты", ШаблонАнкеты);
	КонецЕсли;
		
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Маршрут", Маршрут);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ВыполнениеЗаданийТП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Маршрут = Маршрут;
		МенеджерЗаписи.ВидЗадания = ВыборкаДетальныеЗаписи.ВидЗадания;
		МенеджерЗаписи.Контрагент = Контрагент;
		МенеджерЗаписи.ШаблонАнкеты = ВыборкаДетальныеЗаписи.ШаблонАнкеты;
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Посещение") Тогда
			МенеджерЗаписи.Посещение = ДокументСсылка;
		Иначе
			МенеджерЗаписи.Посещение = ДокументСсылка.Посещение;
		КонецЕсли;
		МенеджерЗаписи.Выполнено = Истина;
		МенеджерЗаписи.Документ = ДокументСсылка;
		МенеджерЗаписи.Записать( Истина );
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьВыполнениеЗаданияТП( ДокументСсылка ) Экспорт
	Перем Запрос, РезультатЗапроса, ВыборкаДетальныеЗаписи, МенеджерЗаписи;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыполнениеЗаданийТП.Маршрут,
	|	ВыполнениеЗаданийТП.ВидЗадания,
	|	ВыполнениеЗаданийТП.Контрагент,
	|	ВыполнениеЗаданийТП.Посещение
	|ИЗ
	|	РегистрСведений.ВыполнениеЗаданийТП КАК ВыполнениеЗаданийТП
	|ГДЕ
	|	ВыполнениеЗаданийТП.Документ = &Документ";
	Если Не ДокументСсылка.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ВыполнениеЗаданийТП.Посещение = &Посещение";
		Запрос.УстановитьПараметр( "Посещение", ДокументСсылка.Посещение );
	КонецЕсли;
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ВыполнениеЗаданийТП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
		МенеджерЗаписи.ВидЗадания = ВыборкаДетальныеЗаписи.ВидЗадания;
		МенеджерЗаписи.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		МенеджерЗаписи.Посещение = ВыборкаДетальныеЗаписи.Посещение;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры
